---
kind: method
id: M:Autodesk.Revit.DB.View.GetTemporaryViewPropertiesName
zh: 视图
source: html/55833c39-874a-4a32-fa6d-1ceee48ea3d7.htm
---
# Autodesk.Revit.DB.View.GetTemporaryViewPropertiesName Method

**中文**: 视图

When Temporary View Properties mode is in progress, name of applied template is returned.
 Outside Temporary View Properties mode, empty string will be returned.

## Syntax (C#)
```csharp
public string GetTemporaryViewPropertiesName()
```